content/daily/2022-03-31.md
+++
title = "2022-03-31"
author = ["System Administrator"]
tags = ["draft", "draft"]
draft = false
+++

## Doing org-roam hack! {#doing-org-roam-hack}

I found that the org-roam-node-find function would also collect org-drill cards. So I wrote a small filter function to filter them out. I added it in my emacs.org

during the process, I'm more familiar with elisp's function, member, cl-defstruct and struct-fieldname function to retrive fields in struct.